In [1]:
import pandas as pd
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
        'sex': ['male', 'female', 'male', 'female', 'female']}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'sex'])
df

  first_name last_name     sex
0      Jason    Miller    male
1      Molly  Jacobson  female
2       Tina       Ali    male
3       Jake    Milner  female
4        Amy     Cooze  female

# # Create a set of dummy variables from the sex variable

In [7]:
df_sex = pd.get_dummies(df['sex'])
df_sex

   female  male
0       0     1
1       1     0
2       0     1
3       1     0
4       1     0

# # Join the dummy variables to the main dataframe

In [15]:
df_new = pd.concat([df, df_sex],axis=1)
df_new

  first_name last_name     sex  female  male
0      Jason    Miller    male       0     1
1      Molly  Jacobson  female       1     0
2       Tina       Ali    male       0     1
3       Jake    Milner  female       1     0
4        Amy     Cooze  female       1     0

In [9]:
# # Alterative for joining the new columns

In [18]:
df_new = df.join(df_sex)
df_new

  first_name last_name     sex  female  male
0      Jason    Miller    male       0     1
1      Molly  Jacobson  female       1     0
2       Tina       Ali    male       0     1
3       Jake    Milner  female       1     0
4        Amy     Cooze  female       1     0

In [26]:
from sklearn.feature_extraction.text import CountVectorizer
corpus = ["Vrushali ran faster than Prashant because she is an athlete.",
         "Vrushali and Prashant ran faster and faster"]
bow = CountVectorizer()
X = bow.fit_transform(corpus)
print bow.get_feature_names()
print X.toarray()

[u'an', u'and', u'athlete', u'because', u'faster', u'is', u'prashant', u'ran', u'she', u'than', u'vrushali']
[[1 0 1 1 1 1 1 1 1 1 1]
 [0 2 0 0 2 0 1 1 0 0 1]]